In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn
np.random.seed(1001)

In [2]:
df = pd.DataFrame(randn(5,3), index=['A','B','C','D','E'], columns=['C1','C2','C3'])
df

         C1        C2        C3
A -1.086446 -0.896065 -0.306299
B -1.339934 -1.206586 -0.641727
C  1.307946  1.845460  0.829115
D -0.023299 -0.208564 -0.916620
E -1.074743 -0.086143  1.175839

In [3]:
df.head(n=2)

         C1        C2        C3
A -1.086446 -0.896065 -0.306299
B -1.339934 -1.206586 -0.641727

In [4]:
df2 = df[ (df['C1']<=0) & (df['C2']<=0) &(df['C3']>=0)].loc[['E'],['C1','C2']]
# afrer those filteration steps return ==>.loc[['E'],['C1','C2']]

In [5]:
df2

         C1        C2
E -1.074743 -0.086143

In [6]:
df>=0

      C1     C2     C3
A  False  False  False
B  False  False  False
C   True   True   True
D  False  False  False
E  False  False   True

# Pandas Filter Methods to Know
1. Logical operators
2. Multiple logical operators
3. Isin
4. Str accessor 
5. Tilde (~)
6. Query
7. Nlargest and nsmallest
8. Loc and iloc

**A common operation in data analysis is to filter values based on a condition or multiple conditions. Pandas provides a variety of ways to filter data. we’ll cover eight different ways to filter a DataFrame.**

## How to Filter Pandas DataFrame
**We start by importing the libraries.**

In [7]:
import numpy as np
import pandas as pd
from numpy.random import random
np.random.seed(1002)

**Let’s create a sample DataFrame for our examples.**

In [8]:
df = pd.DataFrame({

'name':['Jane','John','Ashley','Mike','Emily','Jack','Catlin'],
'ctg':['A','A','C','B','B','C','B'],
'val':np.random.random(7).round(2),
'val2':np.random.randint(1,10, size=7)

})

In [9]:
df

     name ctg   val  val2
0    Jane   A  0.13     9
1    John   A  0.46     7
2  Ashley   C  0.42     6
3    Mike   B  0.60     4
4   Emily   B  0.18     6
5    Jack   C  0.42     7
6  Catlin   B  0.13     7

# 1. Logical Operators
>We can use the logical operators on column values to filter rows.

**We’ve now selected the rows in which the value in the “val” column is greater than 0.5.**

In [10]:
df[df.val > 0.5]

   name ctg  val  val2
3  Mike   B  0.6     4

## The logical operators function also works on strings.
**Only the names that come after “Jane” in alphabetical order are selected.**

In [11]:
df[df.name > 'Jane']

   name ctg   val  val2
1  John   A  0.46     7
3  Mike   B  0.60     4

# 2. Multiple Logical Operators
>Pandas allows for combining multiple logical operators. For instance, we can apply conditions 
on both val and val2 columns.

**The “&” signs stands for “and,” the “|” stands for “or.”**

In [12]:
df[(df.val > 0.5) & (df.val2 == 1)]

Empty DataFrame
Columns: [name, ctg, val, val2]
Index: []

In [13]:
df[(df.val < 0.5) | (df.val2 == 7)]

     name ctg   val  val2
0    Jane   A  0.13     9
1    John   A  0.46     7
2  Ashley   C  0.42     6
4   Emily   B  0.18     6
5    Jack   C  0.42     7
6  Catlin   B  0.13     7

# 3. Isin
>The isin method is another way of applying multiple conditions for filtering. For instance, we can filter the names that exist in a given list.

In [14]:
names = ['John','Catlin','Mike']
df[df.name.isin(names)]

     name ctg   val  val2
1    John   A  0.46     7
3    Mike   B  0.60     4
6  Catlin   B  0.13     7

# 4. Str accessor
>Pandas is a highly efficient library on text data as well. The functions and methods under the str accessor provide flexible ways to filter rows based on strings.

**For instance, we can select the names that start with the letter “J.”**

In [15]:
df[df.name.str.startswith('J')]

   name ctg   val  val2
0  Jane   A  0.13     9
1  John   A  0.46     7
5  Jack   C  0.42     7

## The contains function under the str accessor returns the values that contain a given set of characters.

In [16]:
df[df.name.str.contains('y')]

     name ctg   val  val2
2  Ashley   C  0.42     6
4   Emily   B  0.18     6

# 5. Tilde (~)
>The tilde operator is used for “not” logic in filtering. If we add the tilde operator before
the filter expression, the rows that do not fit the condition are returned.

**We get the names that do not start with the letter “J.”**

In [17]:
df[~df.name.str.contains('J')]

     name ctg   val  val2
2  Ashley   C  0.42     6
3    Mike   B  0.60     4
4   Emily   B  0.18     6
6  Catlin   B  0.13     7

# 6. Query
>The query function offers a little more flexibility at writing the conditions for filtering. We can pass the conditions as a string.

**For instance, the following code returns the rows that belong to the B category and have a value higher than 0.5 in the val column.**

In [18]:
df.query('ctg == "B" and val > 0.5')

   name ctg  val  val2
3  Mike   B  0.6     4

# 7. Nlargest or Nsmallest
>In some cases, we do not have a specific range for filtering but just need the largest or smallest values. The nlargest and nsmallest functions allow you to select rows that have the largest or smallest values in a column, respectively.

In [19]:
df.nlargest(4, 'val')

     name ctg   val  val2
3    Mike   B  0.60     4
1    John   A  0.46     7
2  Ashley   C  0.42     6
5    Jack   C  0.42     7

### We can also specify the number of largest or smallest values to be selected and the name of the column.

In [20]:
df.nsmallest(2, 'val2')

     name ctg   val  val2
3    Mike   B  0.60     4
2  Ashley   C  0.42     6

# 8. Loc and Iloc
>The loc and iloc methods are used to select rows or columns based on index or label.

1. Loc: Select rows or columns using labels
2. Iloc: Select rows or columns using indices
**Thus, they can be used for filtering. However, we can only select a particular part of the DataFrame without specifying a condition.**

In [21]:
df.iloc[3:5, :] #rows 3 and 4, all columns

    name ctg   val  val2
3   Mike   B  0.60     4
4  Emily   B  0.18     6

## If the DataFrame has an integer index, the indices and labels of the rows are the same. Thus, both loc and iloc accomplished the same thing on the rows.

In [22]:
df.loc[3:5, :] #rows 3 and 4, all columns

    name ctg   val  val2
3   Mike   B  0.60     4
4  Emily   B  0.18     6
5   Jack   C  0.42     7

### Let’s update the index of the DataFrame to demonstrate the difference between loc and iloc better.

In [23]:
df.index = ['a','b','c','d','e','f','g']

### We cannot pass integers to the loc method now because the labels of indices are letters.

In [24]:
df.loc['b':'d', :]

     name ctg   val  val2
b    John   A  0.46     7
c  Ashley   C  0.42     6
d    Mike   B  0.60     4